/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "FLASH_PAGE.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart3_rx;

/* USER CODE BEGIN PV */
#define FALSE                          0
#define TRUE                           1
#define OFF                            0
#define ON                             1
#define nTimer                        16
#define TMR2_16bits               65536u
#define EngineSpeedPeriod_Min    785455u     //100rpm
#define EngineSpeedPeriod_Max      5236u     //15000rpm
#define RPM_const              78545455u
#define PWM_0                          0
#define PWM_100                     1001

#define AFR_Bensine                  132
#define AFR_Ethanol                   90
#define Lambda_Stoichiometric        100
#define accel_rate                   150
#define decel_rate                  -150
#define maxPedalOnCrank               70
#define rpm_max                     7000
#define hyst                         300
#define rpm_stopped                  300
#define idle_min                    1100
#define idle_max                    1800
#define quickCmdPos                   30
#define quickCmdNeg                  -30
#define threshould                  2500
#define tfastenrich                 1000
#define tfastenleanment              200
#define tps_min_cutoff                20
#define increment                      1
#define decrement                      1
#define min_tps_IDLE                  30
#define V25                          180
#define Avg_Slope                      5
#define tps_min                       30
#define tps_max                      190
#define lambdaVoltLeanTheshould       30
#define lambdaVoltRichTheshould       70
#define InjectorMaxTime              850   //85% time

uint8_t Cond0=0,Cond1=0,Cond2=0,Cond3=0,Cond4=0,Cond5=0,Cond6=0;
uint32_t Counter0=0,Counter1=0,Counter2=0,Counter3=0,Counter4=0,Counter5=0,Counter6=0,Counter7=0,Counter8=0,Counter9=0,Counter10=0;
uint8_t pulseDetected=0;

//Scheduller
typedef struct Scheduler
{
    uint8_t  program;
    uint32_t target_time;
}sched_var;

sched_var array_sched_var[3];

enum TimerID{Timer0,Timer1,Timer2,Timer3,Timer4,Timer5,Timer6,Timer7,Timer8,Timer9,Timer10,Timer11,Timer12,Timer13,Timer14,Timer15};// TimerNumb;
enum EngineState{WAKEUP,PRIMERINJ,STOP,CRANK,STALL,IDLE,CRUISE,OVERSPEED};
enum Accel{ACCEL,DECEL,STABLE};
enum Lambda{RICH,LEAN,INACTIVE};


typedef struct TimerStruct
{
    uint32_t target_time;
    uint8_t  output;
    void (*func_pointer)();
}timerSchedtype;

timerSchedtype timerList[nTimer]; //={{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0},{0,0,0}};
 
typedef struct system_info
{
        enum EngineState Engine_State;         //WAKEUP
        enum Accel Acceleration;               //STABLE
        uint16_t Engine_Speed_old;             //0
        uint16_t Engine_Speed;                 //0   
        int16_t  deltaEngineSpeed;             //0
        uint16_t engineSpeedPred;              //0
        uint16_t engineSpeedFiltered;          //0
        uint16_t avarageEngineSpeed;           //0
        uint32_t Measured_Period;              //0

        uint32_t TDuty_Input_Signal;           //0
        uint32_t tdutyInputSignalPred;         //0
        uint32_t tdutyInputSignalPredLinear;   //0

        int8_t   deltaTPS;                     //0
        uint8_t  TPS_old;                      //0
        enum Lambda LambDir;                   //RICH
        uint8_t  Update_calc;                  //TRUE
        uint8_t  LambdaRequested;              //100

	      uint32_t Airmass;                      //0
        uint8_t  Voleff;                       //100
        uint8_t  Displacement;                 //135
        uint8_t  AFRstoich;                    //132
				uint16_t InjectorDeadTime;             //50  (1ms)
        uint32_t Injectormassflow;             //0
        uint32_t PW_us;                        //0
				uint32_t PW_percent;                   //0
        uint32_t Fuelmass;                     //0

        uint32_t nOverflow;                    //0
        uint8_t  EngineDiedCounter;            //0
        uint32_t counterCycles;                //0
        uint8_t  counterPos;                   //10
        uint8_t  counterNeg;                   //10
        uint32_t nOverflow_RE;                 //0
        uint32_t nOverflow_FE;                 //0
        uint32_t Rising_Edge_Counter;          //0

        uint8_t  cuttOffTerm;                  //1
        uint8_t  fastEnrichmentTerm;           //100
        uint8_t  warmUpTerm;                   //100
        uint8_t  overspeedTerm;                //100
        uint8_t  crankTerm;                    //100
        uint8_t  lambdaCorrectTerm;            //100
				uint8_t  TotalTerm;                    //100

        uint8_t  VBatRaw;                      //0
        uint8_t  VBatFilt;                     //0
        uint8_t  VBat;                         //0

        uint8_t  VLambdaRaw;                   //0
        uint8_t  VLambdaFilt;                  //0
        uint8_t  Lambda;                       //0

        uint8_t  TempBoardRaw;                 //0
        uint8_t  TempBoardFilt;                //0
        uint8_t  TempBoard;                    //0

        uint8_t  TPSRaw;                       //0
        uint8_t  TPSFilt;                      //0
        uint8_t  TPS;                          //0

        uint8_t  PMapRaw;                      //0
        uint8_t  PMapFilt;                     //0
        uint8_t  PMap;                         //0

        uint8_t  TairRaw;                      //0
        uint8_t  TairFilt;                     //0
        uint8_t  Tair;                         //0

