/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "SCHEDULLER.h"
#include "TIMER_FUNC.h"
#include "FLASH_PAGE.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart3;
DMA_HandleTypeDef hdma_usart3_rx;

/* USER CODE BEGIN PV */
#define FALSE                          0
#define TRUE                           1
#define OFF                            0
#define ON                             1

#define TMR2_16bits               65536u
#define EngineSpeedPeriod_Min    785455u     //100rpm
#define EngineSpeedPeriod_Max      5236u     //15000rpm
#define RPM_const              78545455u
#define PWM_0                          0
#define PWM_100                     1001

#define AFR_Bensine                  132
#define AFR_Ethanol                   90
#define Lambda_Stoichiometric        100
#define accel_rate                   150
#define decel_rate                  -150
#define maxPedalOnCrank               70
#define rpm_max                    11500
#define hyst                         300
#define rpm_stopped                  300
#define idle_min                    1100
#define idle_max                    1800
#define quickCmdPos                   30
#define quickCmdNeg                  -30
#define tfastenrich                 1000
#define tfastenleanment             1000
#define tps_min_cutoff                15
#define increment                      1
#define decrement                      1
#define min_tps_IDLE                  30
#define V25                          180
#define Avg_Slope                      5
#define tps_min                       30
#define tps_max                      190
#define lambdaVoltLeanTheshould       30
#define lambdaVoltRichTheshould       70
#define InjectorMaxTime              800   //80% time
#define R_div_Mair                    29
#define TimeToGetInCutoff           1000

uint8_t Cond0=0,Cond1=0,Cond2=0,Cond3=0,Cond4=0,Cond5=0,Cond6=0,Cond8=0;
uint32_t Counter0=0,Counter1=0,Counter2=0,Counter3=0,Counter4=0,Counter5=0,Counter6=0,Counter7=0,Counter8=0,Counter9=0,Counter10=0;


enum EngineState{WAKEUP,PRIMERINJ,STOP,CRANK,STALL,IDLE,CRUISE,OVERSPEED};
enum Accel{ACCEL,DECEL,STABLE};
enum Lambda{RICH,LEAN,INACTIVE};

//Calibration values
typedef struct Calibration
{
	uint16_t Max_Engine_Speed;	
  uint16_t BP_Engine_Speed[8];
  uint8_t BP_Engine_Temperature[8];
	uint8_t BP_Delta_TPS[8];
	uint8_t BP_MAP[8];
	uint8_t BP_AirTemp[8];
	uint16_t BP_Cycles[8];
	uint8_t BP_WarmUp[8];
	uint8_t TB_Volef[8][8];
	uint8_t TB_LambdaTarget[8][8];
}struct_Calibration;       

volatile struct_Calibration Calibration_RAM = {8000,
	                                            ////The first Engine Speed value in the array needs to be 1200 mandatory
                                              {1200, 2000, 3000, 3500, 4500, 5000, 6000, 7000},
																							{  10,   30,   45,   55,   80,  100,  120,  150},
																							{  64,   64,   64,   64,   64,   64,   64,   64},
																							{  64,   64,   64,   64,   64,   64,   64,   64},
																							{ 200,  170,  160,  150,  140,  120,  105,   50},
																							{ 500, 1000, 1500, 2500, 4000,15000,25000,60000},
																							{ 145,  135,  125,  115,  110,  100,   95,   90},
																						  {{ 50,  100,  100,  100,  100,  100,  100,  100},
																						  {  45,  100,  100,  100,  100,  100,  100,  100},
																						  {  40,  100,  100,  100,  100,  100,  100,  100},
																						  {  30,  100,  100,  100,  100,  100,  100,  100},
																						  {  25,  100,  100,  100,  100,  100,  100,  100},
																						  {  20,  100,  100,  100,  100,  100,  100,  100},
																						  {  15,  100,  100,  100,  100,  100,  100,  100},
																						  {   5,  100,  100,  100,  100,  100,  100,  100}},
                                             {{  90,   90,   90,   90,   90,   90,   90,   90},
																						  { 100,  100,  100,  100,  100,  100,  100,  100},
																						  { 100,  100,  100,  100,  100,  100,  100,  100},
																						  { 100,  100,  100,  100,  100,  100,  100,  100},
																						  { 100,  100,  100,  100,  100,  100,  100,  100},
																						  { 100,  100,  100,  100,  100,  100,  100,  100},
																						  { 100,  100,  100,  100,  100,  100,  100,  100},
																						  { 100,  100,  100,  100,  100,  100,  100,  100}}};

//timerSchedtype timerList[nTimer]; 													
																							
typedef struct system_info
{
		uint8_t  EnabLambdaCtrl;               //1
    enum EngineState Engine_State;         //WAKEUP
    enum Accel Acceleration;               //STABLE
    uint16_t Engine_Speed_old;             //0
    uint16_t Engine_Speed;                 //0
	  uint8_t  pulseDetected;                //0
    int16_t  deltaEngineSpeed;             //0
    uint16_t engineSpeedPred;              //0
    uint16_t engineSpeedFiltered;          //0
    uint16_t avarageEngineSpeed;           //0
    uint32_t Measured_Period;              //0

    uint32_t TDuty_Input_Signal;           //0
    uint32_t tdutyInputSignalPred;         //0
    uint32_t tdutyInputSignalPredLinear;   //0

    int8_t   deltaTPS;                     //0
    uint8_t  TPS_old;                      //0
    enum Lambda LambDir;                   //RICH
    uint8_t  Update_calc;                  //TRUE
    uint8_t  LambdaRequested;              //100
	  uint8_t  LambdaRequestedCrank;         //100

	  uint32_t Airmass;                      //0
    uint8_t  Voleff;                       //100
		uint8_t  VoleffCrank;                  //40
    uint8_t  Displacement;                 //135
    uint8_t  AFRstoich;                    //132
		uint16_t InjectorDeadTime;             //50  (1ms)
    uint32_t Injectormassflow;             //0
    uint32_t PW_us;                        //0
		uint32_t PW_percent;                   //0
    uint32_t Fuelmass;                     //0

    uint32_t nOverflow;                    //0
    uint8_t  EngineDiedCounter;            //0
    uint32_t counterCycles;                //0
    uint8_t  counterPos;                   //10
    uint8_t  counterNeg;                   //10
    uint32_t nOverflow_RE;                 //0
    uint32_t nOverflow_FE;                 //0
    uint32_t Rising_Edge_Counter;          //0

    uint8_t  cuttOffTerm;                  //1
    uint8_t  fastEnrichmentTerm;           //100
    uint8_t  warmUpTerm;                   //100
    uint8_t  overspeedTerm;                //100
    uint8_t  crankTerm;                    //100
    uint8_t  lambdaCorrectTerm;            //100
		uint16_t TotalTerm;                    //100

    uint16_t VBatRaw;                      //0
    uint16_t VBatFilt;                     //0
    uint8_t  VBat;                         //0

    uint16_t VLambdaRaw;                   //0
    uint16_t VLambdaFilt;                  //0
    uint8_t  Lambda;                       //0

    uint16_t TempBoardRaw;                 //0
    uint16_t TempBoardFilt;                //0
    uint8_t  TempBoard;                    //0

		uint16_t TPSRaw;                       //0
    uint16_t TPSFilt;                      //0
    uint8_t  TPS;                          //0

    uint16_t PMapRaw;                      //0
    uint16_t PMapFilt;                     //0
    uint8_t  PMap;                         //0

    uint16_t TairRaw;                      //0
    uint16_t TairFilt;                     //0
    uint8_t  Tair;                         //0

    uint16_t EngineTempRaw;                //0
    uint16_t EngineTempFilt;               //0
